## titanic 데이터 불러오기

데이터 탐색

In [8]:
import pandas as pd

In [6]:
titanic = pd.read_csv('train.csv', index_col=0)

In [10]:
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
titanic.tail()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [12]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [16]:
titanic_slice = titanic.iloc[:10, [3, 4]]

In [17]:
titanic_slice

                Sex   Age
PassengerId
1              male  22.0
2            female  38.0
3            female  26.0
4            female  35.0
5              male  35.0
6              male   NaN
7              male  54.0
8              male   2.0
9            female  27.0
10           female  14.0

## groupby의 이해

분할 : 원 데이터 프레임을 2개의 데이터 프레임으로 분할한다.

In [21]:
titanic_slice.groupby('Sex')

In [22]:
gbo = titanic_slice.groupby('Sex')

In [23]:
type(gbo) 
#datagramegroupby object임을 알 수 있음

pandas.core.groupby.generic.DataFrameGroupBy

In [24]:
gbo.groups
#2개의 그룹 확인 > 행넘버

{'female': [2, 3, 4, 9, 10], 'male': [1, 5, 6, 7, 8]}

In [27]:
l = list(gbo)

In [28]:
l

[('female',
                  Sex   Age
  PassengerId
  2            female  38.0
  3            female  26.0
  4            female  35.0
  9            female  27.0
  10           female  14.0),
 ('male',
                Sex   Age
  PassengerId
  1            male  22.0
  5            male  35.0
  6            male   NaN
  7            male  54.0
  8            male   2.0)]

In [30]:
len(l)

2

In [31]:
l[0]

('female',
                 Sex   Age
 PassengerId
 2            female  38.0
 3            female  26.0
 4            female  35.0
 9            female  27.0
 10           female  14.0)

In [32]:
type(l[0])

#리스트 안에 튜플이 들어간 형태이다.

tuple

In [33]:
l[0][0]

'female'

In [34]:
l[0][1]

                Sex   Age
PassengerId
2            female  38.0
3            female  26.0
4            female  35.0
9            female  27.0
10           female  14.0

In [37]:
type(l[0][1])

pandas.core.frame.DataFrame

In [40]:
#loc을 통해 분할해보기
titanic_slice.loc[titanic_slice.Sex == 'female']

                Sex   Age
PassengerId
2            female  38.0
3            female  26.0
4            female  35.0
9            female  27.0
10           female  14.0

In [48]:
titanic_slice_f = titanic_slice.loc[titanic_slice.Sex == 'female']
titanic_slice_f

                Sex   Age
PassengerId
2            female  38.0
3            female  26.0
4            female  35.0
9            female  27.0
10           female  14.0

In [42]:
titanic_slice_m = titanic_slice.loc[titanic_slice.Sex == 'male']
titanic_slice_m

              Sex   Age
PassengerId
1            male  22.0
5            male  35.0
6            male   NaN
7            male  54.0
8            male   2.0

In [49]:
titanic_slice_f.equals(l[0][1])
#equals를 통해 loc로 만든 데이터 프레임과 groupby 객체를 비교해보기

True

In [51]:
for element in gbo:
    print(element[1])

                Sex   Age
PassengerId
2            female  38.0
3            female  26.0
4            female  35.0
9            female  27.0
10           female  14.0
              Sex   Age
PassengerId
1            male  22.0
5            male  35.0
6            male   NaN
7            male  54.0
8            male   2.0